10/data/attachments/83f148ae1ddd6adc.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_aba59d26-f461-41ba-8077-d03ad1626624</nif:username>
            <nif:friendToBeAdded>Billy_new_Friend_49844_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>